let questions = [
    {
        id: 0,
    },
    {
        id: 1,
        title: "Я чувствую себя эмоционально опустошенным.",
        weight: 0
    },
    {
        id: 2,
        title: "После работы я чувствую себя как «выжатый лимон».",
        weight: 0
    },
    {
        id: 3,
        title: "Утром я чувствую усталость и нежелание идти на работу.",
        weight: 0
    },
    {
        id: 4,
        title: "Я хорошо понимаю, что чувствуют мои подчиненные и коллеги, и стараюсь учитывать это в интересах дела.",
        weight: 0
    },
    {
        id: 5,
        title: "Я чувствую, что общаюсь с некоторыми подчиненными и коллегами как с предметами (без теплоты и расположения к ним).",
        weight: 0
    },
    {
        id: 6,
        title: "После работы на некоторое время хочется уединиться от всех и всего.",
        weight: 0
    },
    {
        id: 7,
        title: "Я умею находить правильное решение в конфликтных ситуациях, возникающих при общении с коллегами.",
        weight: 0
    },
    {
        id: 8,
        title: "Я чувствую угнетенность и апатию.",
        weight: 0
    },
    {
        id: 9,
        title: "Я уверен, что моя работа нужна людям.",
        weight: 0
    },
    {
        id: 10,
        title: "В последнее время я стал более «черствым» по отношению к тем, с кем работаю.",
        weight: 0
    },
    {
        id: 11,
        title: "Я замечаю, что моя работа ожесточает меня.",
        weight: 0
    },
    {
        id: 12,
        title: "У меня много планов на будущее, и я верю в их осуществление.",
        weight: 0
    },
    {
        id: 13,
        title: "Моя работа все больше меня разочаровывает.",
        weight: 0
    },
    {
        id: 14,
        title: "Мне кажется, что я слишком много работаю.",
        weight: 0
    },
    {
        id: 15,
        title: "Бывает, что мне действительно безразлично то, что происходит c некоторыми моими подчиненными и коллегами.",
        weight: 0
    },
    {
        id: 16,
        title: "Мне хочется уединиться и отдохнуть от всего и всех.",
        weight: 0
    },
    {
        id: 17,
        title: "Я легко могу создать атмосферу доброжелательности и сотрудничества в коллективе.",
        weight: 0
    },
    {
        id: 18,
        title: "Во время работы я чувствую приятное оживление.",
        weight: 0
    },
    {
        id: 19,
        title: "Благодаря своей работе я уже сделал в жизни много действительно ценного.",
        weight: 0
    },
    {
        id: 20,
        title: "Я чувствую равнодушие и потерю интереса ко многому, что радовало меня в моей работе.",
        weight: 0
    },
    {
        id: 21,
        title: "На работе я спокойно справляюсь с эмоциональными проблемами.",
        weight: 0
    },
    {
        id: 22,
        title: "В последнее время мне кажется, что коллеги и подчиненные все чаще перекладывают на меня груз своих проблем и обязанностей.",
        weight: 0
    }
]