let questions = [
    {
        id: 0 // Пустой
    },
    {
        id: 1,
        title: "В работе быстро достигать намеченных целей.",
        weight: 0
    },
    {
        id: 2,
        title: "Создавать что-то новое в изучаемой вами области знаний.",
        weight: 0
    },
    {
        id: 3,
        title: "Находить внутреннее удовлетворение в активной общественной жизни.",
        weight: 0
    },
    {
        id: 4,
        title: "Иметь интересную работу, полностью поглощающую вас.",
        weight: 0
    },
    {
        id: 5,
        title: "Учиться, чтобы не отстать от людей вашего круга в образовании.",
        weight: 0
    },
    {
        id: 6,
        title: "Вести такой образ семейной жизни, который ценится обществом.",
        weight: 0
    },
    {
        id: 7,
        title: "Чтобы люди вашего круга в свободное время увлекались тем же, чем вы.",
        weight: 0
    },
    {
        id: 8,
        title: "Получать материальное вознаграждение за общественную деятельность.",
        weight: 0
    },
    {
        id: 9,
        title: "Чтобы облик вашего жилища постоянно изменялся.",
        weight: 0
    },
    {
        id: 10,
        title: "Получить высшее образование, или поступить в аспирантуру, или получить ученую степень.",
        weight: 0
    },
    {
        id: 11,
        title: "Чтобы ваша семья обладала очень высоким уровнем материального благосостояния.",
        weight: 0
    },
    {
        id: 12,
        title: "Избегать конформизма в своих общественно-политических взглядах.",
        weight: 0
    },
    {
        id: 13,
        title: "В своем увлечении быстро достигать намеченных целей.",
        weight: 0
    },
    {
        id: 14,
        title: "Учиться, чтобы «не затеряться в толпе».",
        weight: 0
    },
    {
        id: 15,
        title: "Иметь приятельские отношения с коллегами по работе.",
        weight: 0
    },
    {
        id: 16,
        title: "Состоять членом какого-либо клуба по интересам.",
        weight: 0
    },
    {
        id: 17,
        title: "Развивать свои организаторские способности, занимаясь общественной деятельностью.",
        weight: 0
    },
    {
        id: 18,
        title: "Вместе с семьей посещать театры, художественные выставки, концерты.",
        weight: 0
    },
    {
        id: 19,
        title: "Чтобы ваше увлечение подчеркивало вашу индивидуальность.",
        weight: 0
    },
    {
        id: 20,
        title: "Чтобы уровень образования помог бы вам укрепить свое материальное положение.",
        weight: 0
    },
    {
        id: 21,
        title: "Как оценивают вашу работу другие люди.",
        weight: 0
    },
    {
        id: 22,
        title: "Общаться с разными людьми, активно участвуя в общественной деятельности.",
        weight: 0
    },
    {
        id: 23,
        title: "Учиться, чтобы «не зарывать свой талант в землю».",
        weight: 0
    },
    {
        id: 24,
        title: "Чтобы ваши дети опережали в своем развитии сверстников.",
        weight: 0
    },
    {
        id: 25,
        title: "В свободное время создавать нечто новое, ранее не существовавшее.",
        weight: 0
    },
    {
        id: 26,
        title: "Чтобы ваша профессия подчеркивала вашу индивидуальность.",
        weight: 0
    },
    {
        id: 27,
        title: "Чтобы не отстать от времени, интересоваться общественно-политической жизнью.",
        weight: 0
    },
    {
        id: 28,
        title: "Чтобы уровень вашей образованности позволял вам чувствовать себя уверенно в общении с самыми разными людьми.",
        weight: 0
    },
    {
        id: 29,
        title: "Сохранять полную свободу и независимость от членов вашей семьи.",
        weight: 0
    },
    {
        id: 30,
        title: "Чтобы ваше увлечение помогало вам укрепить свое материальное положение.",
        weight: 0
    },
    {
        id: 31,
        title: "Быть рационализатором, новатором.",
        weight: 0
    },
    {
        id: 32,
        title: "Добиваться конкретных целей, занимаясь общественной деятельностью.",
        weight: 0
    },
    {
        id: 33,
        title: "Учиться, чтобы узнавать что-то новое в изучаемой области знаний.",
        weight: 0
    },
    {
        id: 34,
        title: "Быть лидером в вашей семье.",
        weight: 0
    },
    {
        id: 35,
        title: "Знать свои способности в сфере вашего хобби.",
        weight: 0
    },
    {
        id: 36,
        title: "Чтобы на работе можно было бы приобретать различные дефицитные товары.",
        weight: 0
    },
    {
        id: 37,
        title: "Применять свои собственные методы в общественной деятельности.",
        weight: 0
    },
    {
        id: 38,
        title: "Чтобы семейная жизнь исправила некоторые недостатки вашей натуры.",
        weight: 0
    },
    {
        id: 39,
        title: "Полностью сосредоточиться на своем занятии, проводя свободное время за хобби.",
        weight: 0
    },
    {
        id: 40,
        title: "Быть полезным для общества.",
        weight: 0
    },
    {
        id: 41,
        title: "Постоянно повышать свою профессиональную квалификацию.",
        weight: 0
    },
    {
        id: 42,
        title: "Чтобы лидером в вашей семье был какой-либо другой ее член, кроме вас.",
        weight: 0
    },
    {
        id: 43,
        title: "Получать удовольствие не от результатов вашей работы, а от ее процесса.",
        weight: 0
    },
    {
        id: 44,
        title: "Знать, какого уровня образования можно достичь с вашими способностями.",
        weight: 0
    },
    {
        id: 45,
        title: "Занимать такое место в обществе, которое укрепило бы ваше материальное положение.",
        weight: 0
    },
    {
        id: 46,
        title: "Тщательно планировать свою семейную жизнь.",
        weight: 0
    },
    {
        id: 47,
        title: "Чтобы во время работы сослуживцы постоянно были рядом.",
        weight: 0
    },
    {
        id: 48,
        title: "Чтобы жизнь нашего общества постоянно изменялась.",
        weight: 0
    },
    {
        id: 49,
        title: "Иметь супруга (супругу) из семьи высокого социального положения.",
        weight: 0
    },
    {
        id: 50,
        title: "Чтобы уровень вашего образования помог бы вам занять желаемую должность.",
        weight: 0
    },
    {
        id: 51,
        title: "Иметь собственные политические убеждения.",
        weight: 0
    },
    {
        id: 52,
        title: "Перед началом работы четко ее планировать.",
        weight: 0
    },
    {
        id: 53,
        title: "Постоянно интересоваться новыми методами обучения и воспитания детей в семье.",
        weight: 0
    },
    {
        id: 54,
        title: "Увлекаясь чем-то в свободное время, общаться с людьми, увлекающимися тем же.",
        weight: 0
    },
    {
        id: 55,
        title: "Повышать уровень своего образования, чтобы внести вклад в изучаемую дисциплину.",
        weight: 0
    },
    {
        id: 56,
        title: "Занимаясь общественной деятельностью, учиться убеждать людей в своей точке зрения.",
        weight: 0
    },
    {
        id: 57,
        title: "Чтобы ваша работа была не хуже, чем у других.",
        weight: 0
    },
    {
        id: 58,
        title: "Чтобы ваш супруг (ваша супруга) получал(-а) высокую зарплату.",
        weight: 0
    },
    {
        id: 59,
        title: "Чтобы ваше образование давало возможность для получения дополнительных материальных благ (гонорары, льготы).",
        weight: 0
    },
    {
        id: 60,
        title: "Участвуя в общественной жизни, взаимодействовать с опытными людьми.",
        weight: 0
    },
    {
        id: 61,
        title: "Чтобы ваша работа не противоречила вашим жизненным принципам.",
        weight: 0
    },
    {
        id: 62,
        title: "В супружестве быть всегда абсолютно верным.",
        weight: 0
    },
    {
        id: 63,
        title: "В своем увлечении создавать необходимые в жизни вещи (одежду, мебель и т. п.).",
        weight: 0
    },
    {
        id: 64,
        title: "Повышать уровень своего образования, чтобы быть в кругу умных и интересных людей.",
        weight: 0
    },
    {
        id: 65,
        title: "Чтобы ваши общественно-политические взгляды совпадали с мнением ваших авторитетов.",
        weight: 0
    },
    {
        id: 66,
        title: "Иметь высокооплачиваемую работу.",
        weight: 0
    },
    {
        id: 67,
        title: "В семейной жизни опираться лишь на собственные взгляды, даже если они противоречат общественному мнению.",
        weight: 0
    },
    {
        id: 68,
        title: "Достигать поставленной цели в своей общественной деятельности.",
        weight: 0
    },
    {
        id: 69,
        title: "Приспособиться к характеру вашего супруга (вашей супруги), чтобы избежать семейных конфликтов.",
        weight: 0
    },
    {
        id: 70,
        title: "Тратить время на изучение новых веяний в вашей профессиональной сфере.",
        weight: 0
    },
    {
        id: 71,
        title: "Чтобы увлечение занимало большую часть вашего свободного времени.",
        weight: 0
    },
    {
        id: 72,
        title: "Вносить различные усовершенствования в сферу вашего хобби.",
        weight: 0
    },
    {
        id: 73,
        title: "Чтобы уровень вашего образования соответствовал уровню образования человека, мнение которого вы цените.",
        weight: 0
    },
    {
        id: 74,
        title: "Завоевать уважение людей благодаря своему увлечению.",
        weight: 0
    },
    {
        id: 75,
        title: "Выбрать редкую, уникальную специальность для обучения, чтобы лучше проявить свою индивидуальность.",
        weight: 0
    },
    {
        id: 76,
        title: "Занимаясь на досуге любимым делом, детально продумывать свои действия.",
        weight: 0
    },
    {
        id: 77,
        title: "Чтобы ваши взгляды на жизнь проявлялись в вашем увлечении.",
        weight: 0
    },
    {
        id: 78,
        title: "Учиться, получая при этом удовольствие.",
        weight: 0
    },
    {
        id: 79,
        title: "Чтобы приемы вашей работы изменялись.",
        weight: 0
    },
    {
        id: 80,
        title: "Чтобы круг ваших увлечений постоянно расширялся.",
        weight: 0
    }
]