let questions = [
    {
        id: 0,
    },
    {
        id: 1,
        title: "Когда в воскресенье пополудни я вспоминаю о том, что завтра снова идти на работу, то остаток выходного дня уже испорчен",
        weight: 0
    },
    {
        id: 2,
        title: "Если бы у меня была возможность уйти на пенсию (по выслуге лет, состоянию здоровья), я сделал (а) бы это без промедления",
        weight: 0
    },
    {
        id: 3,
        title: "Коллеги на работе раздражают меня. Невозможно терпеть их одни и те же разговоры",
        weight: 0
    },
    {
        id: 4,
        title: "То насколько меня раздражают коллеги, еще мелочи по сравнению с тем, как выводят меня из равновесия ученики (пациенты, клиенты)",
        weight: 0
    },
    {
        id: 5,
        title: "На протяжении последних трех месяцев я отказывался (отказывалась) от курсов повышения квалификации, от участия в конференциях и т.д.",
        weight: 0
    },
    {
        id: 6,
        title: "Коллегам и/или ученикам я придумал (а) обидные прозвища (например, «идиоты»), которые использую мысленно",
        weight: 0
    },
    {
        id: 7,
        title: "С делами по службе я справляюсь «одной левой», нет ничего такого, что могло бы удивить меня в ней своей новизной",
        weight: 0
    },
    {
        id: 8,
        title: "О моей работе мне едва ли кто скажет что-нибудь новое",
        weight: 0
    },
    {
        id: 9,
        title: "Стоит мне только вспомнить о своей работе, как хочется взять и послать ее ко всем чертям",
        weight: 0
    },
    {
        id: 10,
        title: "За последние три месяца мне не попала в руки ни одна специальная книга, из которой я почерпнул бы что-нибудь новенькое",
        weight: 0
    }
]