let questions = [
    {
        id: 0,
    },
    {
        id: 1,
        title: "Я часто не уверен в собственных решениях",
        weight: 0
    },
    {
        id: 2,
        title: "Иногда мне кажется, что никому нет до меня дела",
        weight: 0
    },
    {
        id: 3,
        title: "Часто, даже хорошо выспавшись, я с трудом заставляю себя встать с постели",
        weight: 0
    },
    {
        id: 4,
        title: "Я постоянно занят и мне это нравится",
        weight: 0
    },
    {
        id: 5,
        title: "Часто я предпочитаю «плыть» по течению",
        weight: 0
    },
    {
        id: 6,
        title: "Я меняю свои планы в зависимости от обстоятельств",
        weight: 0
    },
    {
        id: 7,
        title: "Меня раздражают события, из-за которых я вынужден менять свой распорядок дня",
        weight: 0
    },
    {
        id: 8,
        title: "Непредвиденные трудности порой сильно утомляют меня",
        weight: 0
    },
    {
        id: 9,
        title: "Я всегда контролирую ситуацию настолько, насколько это необходимо",
        weight: 0
    },
    {
        id: 10,
        title: "Порой я так устаю, что уже ничто не может меня заинтересовать",
        weight: 0
    },
    {
        id: 11,
        title: "Порой все, что я делаю, кажется мне бесполезным",
        weight: 0
    },
    {
        id: 12,
        title: "Я стараюсь быть в курсе всего происходящего вокруг меня",
        weight: 0
    },
    {
        id: 13,
        title: "Лучше синица в руках, чем журавль в небе",
        weight: 0
    },
    {
        id: 14,
        title: "Вечером я часто чувствую себя совершенно разбитым",
        weight: 0
    },
    {
        id: 15,
        title: "Я предпочитаю ставить перед собой труднодостижимые цели и добиваться их",
        weight: 0
    },
    {
        id: 16,
        title: "Иногда меня пугают мысли о будущем",
        weight: 0
    },
    {
        id: 17,
        title: "Я всегда уверен, что смогу воплотить в жизнь все, что задумал",
        weight: 0
    },
    {
        id: 18,
        title: "Мне кажется, я не живу полной жизнью, а только играю роль",
        weight: 0
    },
    {
        id: 19,
        title: "Мне кажется, что если бы в прошлом у меня было меньше разочарований и невзгод, мне было бы сейчас легче жить на свете",
        weight: 0
    },
    {
        id: 20,
        title: "Возникающие проблемы часто кажутся мне неразрешимыми",
        weight: 0
    },
    {
        id: 21,
        title: "Испытав поражение, я буду пытаться взять реванш",
        weight: 0
    },
    {
        id: 22,
        title: "Я люблю знакомиться с новыми людьми",
        weight: 0
    },
    {
        id: 23,
        title: "Когда кто-нибудь жалуется, что жизнь скучна, это значит, он просто не умеет видеть интересное",
        weight: 0
    },
    {
        id: 24,
        title: "Мне всегда есть чем заняться",
        weight: 0
    },
    {
        id: 25,
        title: "Я всегда могу повлиять на результат того, что происходит вокруг",
        weight: 0
    },
    {
        id: 26,
        title: "Я часто сожалею о том, что уже сделано",
        weight: 0
    },
    {
        id: 27,
        title: "Если проблема требует больших усилий, я предпочитаю отложить ее до лучших времен",
        weight: 0
    },
    {
        id: 28,
        title: "Мне трудно сближаться с другими людьми",
        weight: 0
    },
    {
        id: 29,
        title: "Как правило, окружающие слушают меня внимательно",
        weight: 0
    },
    {
        id: 30,
        title: "Если бы я мог, я бы многое изменил бы в прошлом",
        weight: 0
    },
    {
        id: 31,
        title: "Я довольно часто откладываю на завтра то, что трудно осуществимо, или то, в чем я не уверен",
        weight: 0
    },
    {
        id: 32,
        title: "Мне кажется, жизнь проходит мимо меня",
        weight: 0
    },
    {
        id: 33,
        title: "Мои мечты редко сбываются",
        weight: 0
    },
    {
        id: 34,
        title: "Неожиданности дарят мне интерес к жизни",
        weight: 0
    },
    {
        id: 35,
        title: "Порой мне кажется, что все мои усилия тщетны",
        weight: 0
    },
    {
        id: 36,
        title: "Порой я мечтаю о спокойной размеренной жизни",
        weight: 0
    },
    {
        id: 37,
        title: "Мне не хватает упорства закончить начатое",
        weight: 0
    },
    {
        id: 38,
        title: "Бывает, жизнь кажется мне скучной и бесцветной",
        weight: 0
    },
    {
        id: 39,
        title: "У меня нет возможности влиять на неожиданные проблемы",
        weight: 0
    },
    {
        id: 40,
        title: "Окружающие меня недооценивают",
        weight: 0
    },
    {
        id: 41,
        title: "Как правило, я работаю с удовольствием",
        weight: 0
    },
    {
        id: 42,
        title: "Иногда я чувствую себя лишним даже в кругу друзей",
        weight: 0
    },
    {
        id: 43,
        title: "Бывает, на меня наваливается столько проблем, что просто руки опускаются",
        weight: 0
    },
    {
        id: 44,
        title: "Друзья уважают меня за упорство и непреклонность",
        weight: 0
    },
    {
        id: 45,
        title: "Я охотно берусь воплощать новые идеи",
        weight: 0
    }
]