let questions = [
    {
        id: 0 // Пустой
    },
    {
        id: 1,
        title:"Строить свою карьеру в пределах конкретной научной или технической сферы",
        weight: 0
    },
    {
        id: 2,
        title:"Осуществлять наблюдение и контроль над людьми, влиять на них на всех уровнях",
        weight: 0
    },
    {
        id: 3,
        title:"Иметь возможность делать все по-своему и не быть стесненным правилами какой-либо организации",
        weight: 0
    },
    {
        id: 4,
        title:"Иметь постоянное место работы с гарантированным окладом и социальной защищенностью",
        weight: 0
    },
    {
        id: 5,
        title:"Употреблять свое умение общаться на пользу людям, помогать другим",
        weight: 0
    },
    {
        id: 6,
        title:"Работать над проблемами, которые представляются почти неразрешимыми",
        weight: 0
    },
    {
        id: 7,
        title:"Вести такой образ жизни, чтобы интересы семьи и карьеры взаимно уравновешивали друг друга",
        weight: 0
    },
    {
        id: 8,
        title:"Создать и построить нечто, что будет всецело моим произведением или идеей",
        weight: 0
    },
    {
        id: 9,
        title:"Продолжать работу по своей специальности, чем получить более высокую должность, не связанную с моей специальностью",
        weight: 0
    },
    {
        id: 10,
        title:"Быть первым руководителем в организации",
        weight: 0
    },
    {
        id: 11,
        title:"Иметь работу, не связанную с режимом или другими организационными ограничениями",
        weight: 0
    },
    {
        id: 12,
        title:"Работать в организации, которая обеспечит мне стабильность на длительный период времени",
        weight: 0
    },
    {
        id: 13,
        title:"Употребить свои умения и способности  на то, чтобы сделать мир лучше",
        weight: 0
    },
    {
        id: 14,
        title:"Соревноваться с другими и побеждать",
        weight: 0
    },
    {
        id: 15,
        title:"Строить карьеру, которая позволит мне не изменять своему образу жизни",
        weight: 0
    },
    {
        id: 16,
        title:"Создать новое коммерческое предприятие",
        weight: 0
    },
    {
        id: 17,
        title:"Посвятить всю жизнь избранной профессии",
        weight: 0
    },
    {
        id: 18,
        title:"Занять высокую руководящую должность",
        weight: 0
    },
    {
        id: 19,
        title:"Иметь работу, которая представляет максимум свободы и автономии в выборе характера занятий, времени выполнения и т.д."
    ,   weight: 0
    },
    {
        id: 20,
        title:"Оставаться на одном месте жительства, чем переехать в связи с повышением",
        weight: 0
    },
    {
        id: 21,
        title:"Иметь возможность использовать свои умения и таланты для служения важной цели",
        weight: 0
    },
    {
        id: 22,
        title:"Единственная действительная цель моей карьеры – находить и решать трудные проблемы, независимо от того, в какой области они возникли\t",
        weight: 0
    },
    {
        id: 23,
        title:"Я всегда стремлюсь уделять одинаковое внимание моей семье и моей карьере",
        weight: 0
    },
    {
        id: 24,
        title:"Я всегда нахожусь в поиске идей, которые дадут мне возможность начать и построить свое собственное дело",
        weight: 0
    },
    {
        id: 25,
        title:"Я соглашусь на руководящую должность только в том случае, если она находится в сфере моей профессиональной компетенции",
        weight: 0
    },
    {
        id: 26,
        title:"Я хотел бы достичь такого положения в организации, которое давало бы возможность наблюдать за работой других и интегрировать их деятельность",
        weight: 0
    },
    {
        id: 27,
        title:"В моей профессиональной деятельности я более всего заботился о своей свободе и автономии",
        weight: 0
    },
    {
        id: 28,
        title:"Для меня важнее остаться на нынешнем месте жительства, чем получить повышение или новую работу в другой деятельности",
        weight: 0
    },
    {
        id: 29,
        title:"Я всегда искал работу, на которой мог бы приносить пользу другим",
        weight: 0
    },
    {
        id: 30,
        title:"Соревнование и выигрыш – это наиболее важные и волнующие стороны моей карьеры",
        weight: 0
    },
    {
        id: 31,
        title:"Карьера имеет смысл только в том случае, если она позволяет вести жизнь, которая мне нравится",
        weight: 0
    },
    {
        id: 32,
        title:"Предпринимательская деятельность составляет центральную часть моей карьеры",
        weight: 0
    },
    {
        id: 33,
        title:"Я бы скорее ушел из организации, чем стал заниматься работой, не связанной с моей профессией",
        weight: 0
    },
    {
        id: 34,
        title:"Я буду считать, что достиг успеха в карьере только тогда, когда стану руководителем высокого уровня в солидной организации",
        weight: 0
    },
    {
        id: 35,
        title:"Я не хочу, чтобы меня стесняла какая-нибудь организация или мир бизнеса",
        weight: 0
    },
    {
        id: 36,
        title:"Я бы предпочел работать в организации, которая обеспечивает длительный контракт",
        weight: 0
    },
    {
        id: 37,
        title:"Я бы хотел посвятить свою карьеру достижению важной и полезной цели",
        weight: 0
    },
    {
        id: 38,
        title:"Я чувствую себя преуспевающим только тогда, когда я постоянно вовлечен в решение трудных проблем или в ситуацию соревнования",
        weight: 0
    },
    {
        id: 39,
        title:"Выбрать и поддерживать определенный образ жизни важнее, чем добиваться успеха в карьере",
        weight: 0
    },
    {
        id: 40,
        title:"Я всегда хотел основать и построить свой собственный бизнес",
        weight: 0
    },
    {
        id: 41,
        title:"Я предпочитаю работу, которая не связана с командировками",
        weight: 0
    }
]