let questions = [
    {
        id: 0 // Пустой
    },
    {
        id: 1,
        title_boy: "Я спокоен",
        title_girl: "Я спокойна",
        weight: 0
    },
    {
        id: 2,
        title_boy: "Мне хочется узнать, понять, докопаться до сути",
        title_girl: "Мне хочется узнать, понять, докопаться до сути",
        weight: 0
    },
    {
        id: 3,
        title_boy: "Я разъярен",
        title_girl: "Я разъярена",
        weight: 0
    },
    {
        id: 4,
        title_boy: "Я стараюсь не делать ошибок",
        title_girl: "Я стараюсь не делать ошибок",
        weight: 0
    },
    {
        id: 5,
        title_boy: "Я напряжен",
        title_girl: "Я напряжена",
        weight: 0
    },
    {
        id: 6,
        title_boy: "Я испытываю любопытство",
        title_girl: "Я испытываю любопытство",
        weight: 0
    },
    {
        id: 7,
        title_boy: "Мне хочется стукнуть кулаком по столу",
        title_girl: "Мне хочется стукнуть кулаком по столу",
        weight: 0
    },
    {
        id: 8,
        title_boy: "Я стремлюсь получать только хорошие и отличные оценки",
        title_girl: "Я стремлюсь получать только хорошие и отличные оценки",
        weight: 0
    },
    {
        id: 9,
        title_boy: "Я раскован",
        title_girl: "Я раскована",
        weight: 0
    },
    {
        id: 10,
        title_boy: "Мне интересно",
        title_girl: "Мне интересно",
        weight: 0
    },
    {
        id: 11,
        title_boy: "Я рассержен",
        title_girl: "Я рассержена",
        weight: 0
    },
    {
        id: 12,
        title_boy: "Я прилагаю все силы, чтобы не отстать от других",
        title_girl: "Я прилагаю все силы, чтобы не отстать от других",
        weight: 0
    },
    {
        id: 13,
        title_boy: "Меня волнуют возможные неудачи",
        title_girl: "Меня волнуют возможные неудачи",
        weight: 0
    },
    {
        id: 14,
        title_boy: "Мне кажется, что урок никогда не кончится",
        title_girl: "Мне кажется, что урок никогда не кончится",
        weight: 0
    },
    {
        id: 15,
        title_boy: "Мне хочется на кого-нибудь накричать",
        title_girl: "Мне хочется на кого-нибудь накричать",
        weight: 0
    },
    {
        id: 16,
        title_boy: "Мне нравится выполнять трудные задания",
        title_girl: "Мне нравится выполнять трудные задания",
        weight: 0
    },
    {
        id: 17,
        title_boy: "Я чувствую себя неудачником",
        title_girl: "Я чувствую себя неудачницей",
        weight: 0
    },
    {
        id: 18,
        title_boy: "Я чувствую себя исследователем",
        title_girl: "Я чувствую себя исследователем",
        weight: 0
    },
    {
        id: 19,
        title_boy: "Мне хочется что-нибудь сломать",
        title_girl: "Мне хочется что-нибудь сломать",
        weight: 0
    },
    {
        id: 20,
        title_boy: "Я избегаю заданий, с которыми не могу справиться",
        title_girl: "Я избегаю заданий, с которыми не могу справиться",
        weight: 0
    },
    {
        id: 21,
        title_boy: "Я взвинчен",
        title_girl: "Я взвинчена",
        weight: 0
    },
    {
        id: 22,
        title_boy: "Я энергичен",
        title_girl: "Я энергична",
        weight: 0
    },
    {
        id: 23,
        title_boy: "Я взбешен",
        title_girl: "Я взбешена",
        weight: 0
    },
    {
        id: 24,
        title_boy: "Я стремлюсь добиться успеха",
        title_girl: "Я стремлюсь добиться успеха",
        weight: 0
    },
    {
        id: 25,
        title_boy: "Я чувствую себя совершенно свободно",
        title_girl: "Я чувствую себя совершенно свободно",
        weight: 0
    },
    {
        id: 26,
        title_boy: "Я чувствую, что у меня хорошо работает голова",
        title_girl: "Я чувствую, что у меня хорошо работает голова",
        weight: 0
    },
    {
        id: 27,
        title_boy: "Я раздражен",
        title_girl: "Я раздражена",
        weight: 0
    },
    {
        id: 28,
        title_boy: "Я пытаюсь избежать неудачи",
        title_girl: "Я пытаюсь избежать неудачи",
        weight: 0
    },
    {
        id: 29,
        title_boy: "Мне не хватает уверенности в себе",
        title_girl: "Мне не хватает уверенности в себе",
        weight: 0
    },
    {
        id: 30,
        title_boy: "Мне скучно",
        title_girl: "Мне скучно",
        weight: 0
    },
    {
        id: 31,
        title_boy: "Я злюсь",
        title_girl: "Я злюсь",
        weight: 0
    },
    {
        id: 32,
        title_boy: "Я стараюсь не получить двойку",
        title_girl: "Я стараюсь не получить двойку",
        weight: 0
    },
    {
        id: 33,
        title_boy: "Я уравновешен",
        title_girl: "Я уравновешена",
        weight: 0
    },
    {
        id: 34,
        title_boy: "Мне нравится думать, решать",
        title_girl: "Мне нравится думать, решать",
        weight: 0
    },
    {
        id: 35,
        title_boy: "Я чувствую себя обманутым",
        title_girl: "Я чувствую себя обманутой",
        weight: 0
    },
    {
        id: 36,
        title_boy: "Я делаю все, чтобы быть среди лучших учеников",
        title_girl: "Я делаю все, чтобы быть среди лучших учеников",
        weight: 0
    },
    {
        id: 37,
        title_boy: "Я боюсь",
        title_girl: "Я боюсь",
        weight: 0
    },
    {
        id: 38,
        title_boy: "Я чувствую уныние и тоску",
        title_girl: "Я чувствую уныние и тоску",
        weight: 0
    },
    {
        id: 39,
        title_boy: "Меня многое приводит в ярость",
        title_girl: "Меня многое приводит в ярость",
        weight: 0
    },
    {
        id: 40,
        title_boy: "Я стремлюсь показать свои способности и ум",
        title_girl: "Я стремлюсь показать свои способности и ум",
        weight: 0
    }
]